# 记2025年5月10日日记
##### 星期六/天气晴/心情坏转好

***
今天是我第一次用github来写日记，我想要保存我的痛苦，开心与生活。我的仓库设置为开放，所以大家都可以看到，如果有人看到觉得有意思也可以给颗星（当然不给最好，到时候我怕我的日记被围观了）。  

---
虽然今天是周六，但是身为大学牲的我还是要去上课。想起来以前高中老师说“到了大学就都轻松了”，我真的想当时就冲上去说，“大学轻松个头”。谁家好人周六上早八，别人周末一节课也没有，高中生都不用担心熬夜第二天起不来。  
早八是一周一度的英语课，好在我从来没有听过。不过，不妨碍我上课中半路拉肚子，估计是着凉了，我忘了昨天吃了什么，但是空调温度他们开的很低。恐怖的是，拉完回来发现在抽人回答，倒吸一口凉气。好在没有被抽到。  
英语课上完出门右拐上楼梯再左拐是军事理论课。其实我很明白培养学生对于国防军事的意识很重要，但是他讲课一股。。。家长味——这是我所讨厌的。所以我压更是啥也没听，挺闲的。不过好在我带了一个蓝牙键盘和手机支架(手机拿在手里拍照）。  
![](https://raw.githubusercontent.com/LongelyJidao/Picture/main/keyboard.jpg)  
随后我所做的，便是连上手机，用手机里的termux来运行一个完整的linux（我认为应该是基本完整），然后开始用vim来给[screeps](screeps.com)写代码。鉴于没吃早饭，这时候也快到中午了，低血糖上来了，摇摇欲坠。代码写得有多好就别想了。  
中饭我好好犒劳了一下自己，因为下午要赶去场地上口语课。时间紧迫，没有时间再来睡觉，只能稍微趴一会儿便匆匆出发。不过我学校到场地很近，扫一辆共享电单车十多分钟的事情。  
等着等着，大家也慢慢来了。旁边的一个哥们看我在折腾我的termux，我也给他介绍了一下。要好的哥们来了之后，也捎带着给他们讲了一下，顺便推荐了一下screeps这个游戏。  
OK,今天的重点时刻到了。我有些喜欢口语班上的一个女同学，我不知道怎么去说。可能是我分手后的创伤，可能是我希望去获得一个人的陪伴，亦或者像”她“说的，我很缺爱。遇见她挺好的，也很聊得来。我想要更上一步，但是害怕我并不是喜欢她，反而会伤害她的感情；我想要去爱，但是上一段的感情给我的冲击还没有散去，带着上一任的感情开启下一任是一种极其不负责任的行为。我觉得很纠结。  
今天我想要创造接触机会，但是总是觉得很尴尬，不知道如何是好。但是在线上聊得又很投机，唉。。。。
